In [27]:
import pandas as pd
import numpy as np
from pathlib import Path
import seaborn as sns
import matplotlib.pyplot as plt

In [28]:
# Replace BASE_DIR with the actual path to your project directory
BASE_DIR = Path("E:/Labmentrix/Projects/Project_8")

In [29]:
# take relative path to read the file
city = pd.read_excel(Path(BASE_DIR,r'data/raw/City.xlsx'))
continent = pd.read_excel(Path(BASE_DIR,r'data/raw/Continent.xlsx'))
country = pd.read_excel(Path(BASE_DIR,r'data/raw/Country.xlsx'))
item = pd.read_excel(Path(BASE_DIR,r'data/raw/Item.xlsx'))
visit_mode = pd.read_excel(Path(BASE_DIR,r'data/raw/Mode.xlsx'))
region = pd.read_excel(Path(BASE_DIR,r'data/raw/Region.xlsx'))
transaction = pd.read_excel(Path(BASE_DIR,r'data/raw/Transaction.xlsx'))
attraction_type = pd.read_excel(Path(BASE_DIR,r'data/raw/Type.xlsx'))
User = pd.read_excel(Path(BASE_DIR,r'data/raw/User.xlsx'))

In [30]:
city.head()

   CityId      CityName  CountryId
0       0             -          0
1       1        Douala          1
2       2  South Region          1
3       3     N'Djamena          2
4       4        Kigali          3

In [31]:
continent.head()

   ContinentId            Continent
0            0                    -
1            1               Africa
2            2              America
3            3                 Asia
4            4  Australia & Oceania

In [32]:
country.head()

   CountryId   Country  RegionId
0          0         -         0
1          1  Cameroon         1
2          2      Chad         1
3          3    Rwanda         1
4          4  Ethiopia         2

In [33]:
item.head()

,AttractionId,AttractionCityId,AttractionTypeId,Attraction,AttractionAddress
0,369,1,13,Kuta Beach - Bali,Kuta
1,481,1,13,Nusa Dua Beach,"Semenanjung Nusa Dua, Nusa Dua 80517 Indonesia"
2,640,1,63,Sacred Monkey Forest Sanctuary,"Jl. Monkey Forest, Ubud 80571 Indonesia"
3,650,1,13,Sanur Beach,Sanur
4,673,1,13,Seminyak Beach,Seminyak

In [34]:
visit_mode.head()

   VisitModeId VisitMode
0            0         -
1            1  Business
2            2   Couples
3            3    Family
4            4   Friends

In [35]:
region.head()

            Region  RegionId  ContinentId
0                -         0            0
1   Central Africa         1            1
2      East Africa         2            1
3     North Africa         3            1
4  Southern Africa         4            1

In [36]:
transaction.head()

,TransactionId,UserId,VisitYear,VisitMonth,VisitMode,AttractionId,Rating
0,3,70456,2022,10,2,640,5
1,8,7567,2022,10,4,640,5
2,9,79069,2022,10,3,640,5
3,10,31019,2022,10,3,640,3
4,15,43611,2022,10,2,640,3

In [37]:
User.head()

   UserId  ContinentId  RegionId  CountryId  CityId
0      14            5        20        155   220.0
1      16            3        14        101  3098.0
2      20            4        15        109  4303.0
3      23            1         4         22   154.0
4      25            3        14        101  3098.0

In [38]:
attraction_type.head()

   AttractionTypeId         AttractionType
0                 2          Ancient Ruins
1                10                Ballets
2                13                Beaches
3                19        Caverns & Caves
4                34  Flea & Street Markets

In [39]:
# using mysql and joins dataset have been merged and saved in processed folder for reference and details check notebooks\sql_import.ipynb
numeric_data = pd.read_csv(Path(BASE_DIR,r"data\processed\numeric_data.csv"), index_col="Unnamed: 0")
numeric_data.set_index("TransactionId",inplace=True)

In [40]:
numeric_data

,UserId,VisitYear,VisitMonth,VisitMode,Rating,user_continent_id,user_region_id,user_country_id,user_city_id,AttractionId,AttractionCityId,AttractionTypeId,attraction_countryid,attraction_regionid,attraction_continentid
TransactionId,,,,,,,,,,,,,,,
3,70456,2022,10,2,5,5,21,163,4341.0,640,1,63,1,1,1
8,7567,2022,10,4,5,2,8,48,464.0,640,1,63,1,1,1
9,79069,2022,10,3,5,2,9,54,774.0,640,1,63,1,1,1
10,31019,2022,10,3,3,5,17,135,583.0,640,1,63,1,1,1
15,43611,2022,10,2,3,5,21,163,1396.0,640,1,63,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
211227,87100,2018,9,2,4,5,21,159,7460.0,1297,3,44,2,1,1
211238,88112,2016,2,2,5,5,17,133,6164.0,1297,3,44,2,1,1
211239,88112,2016,2,2,4,5,17,133,6164.0,1297,3,44,2,1,1
211240,88112,2016,2,2,4,5,17,133,6164.0,1297,3,44,2,1,1
211241,88112,2016,2,2,5,5,17,133,6164.0,1297,3,44,2,1,1

In [41]:
pd.DataFrame(numeric_data["UserId"].value_counts())

        count
UserId
60799      59
84842      40
83466      33
70663      25
53429      25
...       ...
84090       1
84587       1
85654       1
86068       1
86239       1

[33530 rows x 1 columns]

In [42]:
numeric_data=numeric_data.merge(pd.DataFrame(numeric_data["UserId"].value_counts()),left_on="UserId", right_on="UserId")

## EDA

In [43]:
numeric_data.rename(columns={"count":"UserId_count"}, inplace=True)

### Using numeric data for EDA with ids only as even if used text based data, we will have to convert it to numeric data for modeling. So, we will do EDA on numeric data only.

In [44]:
numeric_data.value_counts("UserId_count")

UserId_count
1     22912
2     13066
3      6618
4      3588
5      2155
6      1224
7       805
8       560
9       504
11      264
10      220
14      168
15      150
12      144
13       91
22       88
20       60
59       59
25       50
40       40
17       34
33       33
23       23
21       21
19       19
18       18
16       16
Name: count, dtype: int64

In [45]:
numeric_data

,UserId,VisitYear,VisitMonth,VisitMode,Rating,user_continent_id,user_region_id,user_country_id,user_city_id,AttractionId,AttractionCityId,AttractionTypeId,attraction_countryid,attraction_regionid,attraction_continentid,UserId_count
0,70456,2022,10,2,5,5,21,163,4341.0,640,1,63,1,1,1,1
1,7567,2022,10,4,5,2,8,48,464.0,640,1,63,1,1,1,1
2,79069,2022,10,3,5,2,9,54,774.0,640,1,63,1,1,1,1
3,31019,2022,10,3,3,5,17,135,583.0,640,1,63,1,1,1,2
4,43611,2022,10,2,3,5,21,163,1396.0,640,1,63,1,1,1,3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
52925,87100,2018,9,2,4,5,21,159,7460.0,1297,3,44,2,1,1,4
52926,88112,2016,2,2,5,5,17,133,6164.0,1297,3,44,2,1,1,4
52927,88112,2016,2,2,4,5,17,133,6164.0,1297,3,44,2,1,1,4
52928,88112,2016,2,2,4,5,17,133,6164.0,1297,3,44,2,1,1,4
52929,88112,2016,2,2,5,5,17,133,6164.0,1297,3,44,2,1,1,4

In [46]:
numeric_data.value_counts("AttractionId")

AttractionId
640     13198
841      6429
748      5815
824      3359
737      3352
650      3044
673      2914
369      2765
1171     2235
749      2190
481      2104
1166     1324
1278      978
1297      798
888       381
1220      377
1238      377
1280      373
1225      204
1133      135
1137      130
947        83
937        64
897        55
913        54
975        53
920        44
877        36
949        31
928        28
Name: count, dtype: int64

In [47]:
numeric_data.value_counts("user_country_id")

user_country_id
109    13322
163     6722
51      6261
101     4842
106     2807
       ...
24         1
33         1
83         1
53         1
2          1
Name: count, Length: 153, dtype: int64

In [48]:
numeric_data.columns

Index(['UserId', 'VisitYear', 'VisitMonth', 'VisitMode', 'Rating',
       'user_continent_id', 'user_region_id', 'user_country_id',
       'user_city_id', 'AttractionId', 'AttractionCityId', 'AttractionTypeId',
       'attraction_countryid', 'attraction_regionid', 'attraction_continentid',
       'UserId_count'],
      dtype='str')

In [49]:
numeric_data.groupby("AttractionId",as_index=False)["Rating"].mean().sort_values("Rating",ascending=False)

    AttractionId    Rating
17           947  4.698795
9            841  4.646601
11           888  4.611549
15           928  4.571429
20          1133  4.503704
14           920  4.318182
1            481  4.275665
2            640  4.267086
27          1278  4.256646
8            824  4.219411
19           975  4.207547
5            737  4.194809
24          1220  4.180371
6            748  4.157524
26          1238  4.124668
13           913  4.092593
23          1171  4.079195
18           949  4.032258
10           877  4.027778
3            650  3.976347
12           897  3.963636
25          1225  3.936275
7            749  3.895434
22          1166  3.869335
21          1137  3.846154
28          1280  3.815013
4            673  3.800618
16           937  3.578125
29          1297  3.538847
0            369  3.415190

In [50]:
numeric_data["AttractionId"].nunique()

30